In [1]:
import pandas as pd
import numpy as np

In [44]:

data_dic = {'col_1':[1,2,3,4,5],
           'col_2':[111,222,333,111,555],
           'col_3':['alpha','bravo','charlie',np.nan,np.nan],
           }
df = pd.DataFrame(data_dic,index=[1,2,3,4,5])
df

   col_1  col_2    col_3
1      1    111    alpha
2      2    222    bravo
3      3    333  charlie
4      4    111      NaN
5      5    555      NaN

In [4]:
df.info() #get info on dataframe

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 1 to 5
Data columns (total 3 columns):
col_1    5 non-null int64
col_2    5 non-null int64
col_3    3 non-null object
dtypes: int64(2), object(1)
memory usage: 160.0+ bytes

In [5]:
df.head()  #get first few values

   col_1  col_2    col_3
1      1    111    alpha
2      2    222    bravo
3      3    333  charlie
4      4    111      NaN
5      5    555      NaN

In [6]:
df.isnull()  #boolean mask indicating if values are null

   col_1  col_2  col_3
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False   True
5  False  False   True

In [7]:
print(df.dropna(axis=0) )#drop rows with nan
print(df.dropna(axis=1))

   col_1  col_2    col_3
1      1    111    alpha
2      2    222    bravo
3      3    333  charlie
   col_1  col_2
1      1    111
2      2    222
3      3    333
4      4    111
5      5    555

In [8]:
df.fillna(value='xyz') #fill with a specific value

   col_1  col_2    col_3
1      1    111    alpha
2      2    222    bravo
3      3    333  charlie
4      4    111      xyz
5      5    555      xyz

In [9]:
df.fillna(method='ffill') #fill values forward

   col_1  col_2    col_3
1      1    111    alpha
2      2    222    bravo
3      3    333  charlie
4      4    111  charlie
5      5    555  charlie

In [10]:
df['col_1'].unique() #find unique values

array([1, 2, 3, 4, 5], dtype=int64)

In [11]:
df['col_2'].unique()

array([111, 222, 333, 555], dtype=int64)

In [15]:
df['col_3'].unique()

array(['alpha', 'bravo', 'charlie', nan], dtype=object)

In [16]:
df['col_2'].nunique() # get the number of unique values

4

In [18]:
df['col_1'].value_counts()  #get the number of times unique values appear

5    1
4    1
3    1
2    1
1    1
Name: col_1, dtype: int64

In [19]:
df['col_2'].value_counts()

111    2
222    1
333    1
555    1
Name: col_2, dtype: int64

In [20]:
df.sort_values(by='col_2')

   col_1  col_2    col_3
1      1    111    alpha
4      4    111      NaN
2      2    222    bravo
3      3    333  charlie
5      5    555      NaN

In [21]:
df['col_1']>2 #boolean mask

1    False
2    False
3     True
4     True
5     True
Name: col_1, dtype: bool

In [23]:
bool_ser=(df['col_1']>2 ) & (df['col_2'] == 111) #conditional filtering

In [24]:
bool_ser

1    False
2    False
3    False
4     True
5    False
dtype: bool

In [25]:
df[bool_ser]

   col_1  col_2 col_3
4      4    111   NaN

In [31]:
def square(value):
    return value**2

In [32]:
df['col_1'].apply(square) #we pass a function we want executed in our data using apply method

1     1
2     4
3     9
4    16
5    25
Name: col_1, dtype: int64

In [34]:
#we can skip writing the function and just write the lambda expression 
df['col_1'].apply(lambda value:value**2)

1     1
2     4
3     9
4    16
5    25
Name: col_1, dtype: int64

In [36]:
df

   col_1  col_2    col_3
1      1    111    alpha
2      2    222    bravo
3      3    333  charlie
4      4    111      NaN
5      5    555      NaN

In [35]:
#we can pass inbuilt functions as well
df['col_3'][0:3].apply(len) #can't use the len of nan which is in fact a float

1    5
2    5
3    7
Name: col_3, dtype: int64

In [38]:
#getting the index
df.index

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [39]:
#get the columns
df.columns

Index(['col_1', 'col_2', 'col_3'], dtype='object')

In [40]:
#drop a column
df.drop('col_1',axis=1)

   col_2    col_3
1    111    alpha
2    222    bravo
3    333  charlie
4    111      NaN
5    555      NaN

In [42]:
#if we want to delete the column entirely, inplace should be set to true
df.drop('col_1',axis=1,inplace=True)

In [45]:
df

   col_1  col_2    col_3
1      1    111    alpha
2      2    222    bravo
3      3    333  charlie
4      4    111      NaN
5      5    555      NaN

In [47]:
#Pivot table creates a spread sheet style as pivot table
df.pivot_table(values='col_2',index='col_1',columns='col_3')

col_3  alpha  bravo  charlie
col_1
1      111.0    NaN      NaN
2        NaN  222.0      NaN
3        NaN    NaN    333.0

In [48]:
# Creating DataFrame 
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

foobar = pd.DataFrame(data)

In [49]:
foobar

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [51]:
#we can make multilevel index using the pivot_table
foobar.pivot_table(values = 'D',index = ['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN